using System.Collections.Generic;

namespace Scripts.StaticData
{
    public static class CustomRuLocalization
    {
        public static Dictionary<int,string> SpecAttack = new Dictionary<int,string>() 
        { {0,"Оглушение" }, {1,"Двойная Атака" }, {2,"Круговое оглушения" }, {3,"Стрельба" }, {4,"Молния" }, {5,"Огненный шар" }, {6,"Заморозить" }, {7,"Токсичный" },
            {8, "Гипноз" },{9,"Лечить" },{10,"Мотивация" },{11,"Мотивация Всех" },{12,"Ярость" },{13,"Поднимать" },{14,"Прорыв" },{15,"Аура" },{16,"Выявление" },
            {17,"Невидимость" },{18,"Боевой клич" },{19,"Вампиризм" },{20,"Менять" },{21,"Ледяная Стрела" },{22,"Дикая стрела" },{23,"Град Стрелы" },{24,"Телепортация" },
            {25,"Круговое отравление" }
        };

        public static Dictionary<int,string> HeroTypeId = new Dictionary<int,string>()
        {
            {0,"Лучник" },{1,"Убийца" },{2,"Варвар" },{3,"Берсерк" },{4,"Чародей" },{5,"Командир" },{6,"Эльф" },{7,"Фея" },{8,"Зеленая Стрела" },{9,"Король" },
            {10, "Рыцарь" },{11,"Конунг" },{12,"Отравитель" },{13,"Священник" },{14,"Принцесса" },{15,"Сталкер" },{16,"Сабзиро" },{17,"Викинг" },{18,"Воин" },{19,"Ведьмак Синий" },
            {20, "Ведьмак Зеленый" },{21,"Ведьмак Красный" }
        };

        public static Dictionary<int,string> Specialization = new Dictionary<int, string>()
        {
            {0, "Стрелок" },{1,"Воин" },{2,"Маг"}
        };

        public static Dictionary<int, string> MonsterTypeId = new Dictionary<int, string>()
        {
            {22,"Гриб" },{23,"Летучая мышь"},{24,"Пчела"},{25,"Хамелеон"},{26,"Циклоп"},{27,"Краб"},{28,"Дикий человек"},{29,"Пират"},{30,"Темный Паук"},{31," Красный Циклоп"},
            {32,"Дьявол" },{33,"Оборотень"},{34,"Темный рыцарь"},{35,"Дракон"},{36,"Белый Голем"},{37,"Белый Циклоп"},{38,"Падший ангел"},{39,"Растение"},{40,"Зеленая Улитка"},
            {41,"Саламандра" },{42,"Ящерица"},{43,"Темный Гриб"},{44,"Волшебник"},{45,"Призрак"},{46,"Темный Маг"},{47,"Змея"},{48,"Дикий лидер"},{49,"Крыса"},{50,"Некромант"},
            {51,"Сумеричный Эльф" },{52,"Улитка"},{53,"Скелет"},{54,"Орк"},{55,"Голем"},{56,"Демон"},{57,"Червь"},{58,"Темное растение"},{59,"Паук"},{60,"Человек-рыба"},
            {61,"Дикая девушка"}
        };

        public static string GetRuMonster(int index)
        {
            return MonsterTypeId[index];
        }

        public static string GetRuHeroTypeId(int index)
        {
            return HeroTypeId[index];
        }

        public static string GetSpecialization(int index)
        {
            return Specialization[index];
        }

        public static string GetSpecAttack(int index)
        {
            return SpecAttack[index];
        }
    }
}
